package com.ruoyi.project.system.dto;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum ErrorCode {

    E000001("E000001", "商户APP配置不存在"),
    E000002("E000002", "签名校验失败"),
    E000003("E000003", "重复提交订单"),
    E000004("E000004", "用户充值地址为空"),
    E000005("E000005", "用户提现地址为空"),
    E000006("E000006", "商户对应的代理商不存在"),
    E000007("E000007", "代理商没有给商户设定手续费"),
    E000008("E000008", "平台没有给代理商设定手续费"),
    E000009("E000009", "商户余额不足于用户提现"),
    E000010("E000010", "充值平台没有配置H5充值主题"),
    E000011("E000011", "充值平台没有配置默认H5充值主题"),
    E000012("E000012", "充值平台没有配置最低充值金额"),
    E000013("E000013", "没有达到最低充值金额，请重新调整金额"),
    E000014("E000014", "充值平台没有配置最低提现金额"),
    E000015("E000015", "没有达到最低提现金额，请重新调整金额"),
    E000016("E000016", "用户提现地址不正确"),
    ;

    private String code;

    private String error;
}
